qiaoliang/arduino-learning/ESP8266/1-4-File_WIFI/src/main.cpp
/*#include <Servo.h>                           // 引用 ESP8266 伺服舵机 功能库文件
  Servo servo;                                 // 创建舵机对象
  servo.attach(数字引脚,[1000],[2000]);         // 连舵机黄线的引脚,脉冲信号一般设为 500微秒 到 2500微秒
  servo.attached();                            // <bool>获取舵机对象是否已经连接引脚
  servo.detach();                              // 断开引脚控制,使对象不再控制任何舵机

  servo.write(新角度值);                        // 控制转动舵机,数值<200视为角度,否则为脉冲时间(微秒)
  servo.read();                                // <int>获取最后一次write()命令的角度值,0-180 之间
  servo.writeMicroseconds(新脉冲值);            // 控制转动舵机,发送信号脉冲宽度值 500-2500 微秒之间
  servo.readMicroseconds();                    // <int>获取最后一次writeMicroseconds()命令脉冲值

  ESP8266开发板数字引脚 D0-D8 总共9个引脚可用来控制舵机,其中有个引脚与板载LDE灯共享请慎用..
  库文件Servo.cpp里值<200才视为角度,对270度的舵机建议用writeMicroseconds().注意:360度舵机不能控制角度的

  9克舵机从一个角度转到另一个角度需要时间,约120毫秒60度.从0度转到180度需要360毫秒,1秒=1000毫秒=100000微秒
  调用write() 5微秒就能返回,同时write()多个舵机,就能看到多舵机同时转动的效果.
  当我们希望舵机是一个接一个轮流转动,或者转到目标角度后再其他操作,可在调用write()后可以再适当的延时 delay();
*/
/*
   控制舵机的高电平脉冲信号在周期20000微秒里占用500-2500微秒时间控制舵机转到指定角度..模拟舵机要持续发信号直到目标角度..
    500微秒----------0度；   1秒=1000毫秒，1毫秒=1000微秒
   1000微秒---------45度；
   1500微秒---------90度；
   2000微秒--------135度；
   2500微秒--------180度；
   高电平脉冲每g≈1度≈(2500-500)/180,所以1微秒≈0.1度  不用太较真..

   SG90,TS90A 空载转速:0.12秒/60度(4.8V)=120毫秒60度=2毫秒1度
   SG90 工作电压4.8V~6V  待机5ma,空载60ma,工作电流>300ma.最大负载电流700ma.  堵转扭矩:1.2~1.4公斤/厘米(4.8V)
   TS90A工作电压4.8V~6V  待机5ma,空载60ma,工作电流>300ma.最大负载电流700ma.  堵转扭矩:1.6~1.8公斤/厘米(4.8V)
   MG996R
   注意:电脑蓝色USB3.0插口输出5V900ma电流，，黑色USB2.0输出5V500ma电流(电流严重不够)....
   插电脑USB3.0调试六轴机械臂勉强能用.可外接 5V2a+手机电源 或其他5V8a电源

   舵机三根电线  黄线->接信号(D0~D8),红线->接正极(5V),褐线->接负极(G)

   创客与编程      https://shop104415339.taobao.com/
   四轴机械臂      https://item.taobao.com/item.htm?ft=t&id=634846120104
   板子与舵机      https://item.taobao.com/item.htm?ft=t&id=665636638155
*/
// 编译此代码需要先安装ESP8266开发板文件包,并且只能上传到ESP8266芯片的开发板运行.
// arduino 菜单->文件->首选项 添加开发板管理器网址 https://arduino.esp8266.com/stable/package_esp8266com_index.json
// 再 菜单->开发板->开发板管理器 搜esp8266下载最新版本(3.0.0版起)
// 注意:ESP8266不太好下载，易出错中断,要多试，换时间试，若还下载不来，可参考网盘里 arduino15 文件夹里的说明...
// 请正确选择 菜单->工具->开发板 与 端口COM(需安装CH341串口驱动),8266有好几种板子.选错会导致 pin[6] 变量与板上插口不对应

#include <ESP8266WiFi.h> //编译此代码需要先安装ESP8266开发板文件包,并且只能上传到ESP8266芯片的开发板才能运行.
// #include <WiFiClient.h>
#include <ESP8266WebServer.h>        //小型HTTP网页服务
#include <ESP8266HTTPUpdateServer.h> //寄生网页服务,接受 固件.bin 或 系统.bin http://X.X.X.X/upbin Firmware:固件,FileSystem:文件系统

String AP_SSID = "ESP8266"; // ESP8266自已创建的热点名称
String AP_PSK = "12345678"; // 热点密码

String STA_SSID = "MYHOME";  // 路由器WIFI或手机电脑的移动热点名称
String STA_PSK = "12345678"; // 热点密码

bool Response = false;           // 应答标记 true false.网页请求应该快速回答,但R指令执行动作文件可能要很久.
ESP8266WebServer Web(80);        // 建立Web服务对象,HTTP端口80
ESP8266HTTPUpdateServer Updater; // ESP8266 网络[更新固件]服务
// ESP8266支持WIFI远程更新固件代码，在 arduino菜单 项目->导出已编译的二进制文件 .bin
// 机械手控制网页里点 [更新固件],帐号 admin 密码12345678，点 Firmware 选择这个 .bin文件，点 Update Firmware 更新固件代码..
// 注意:有些手机的浏览器不支持选择固件文件,请换个网页浏览器或用电脑网页更新固件

// arduino 菜单->项目->加载库->管理库 搜 ArduinoJson 安装.
#include <ArduinoJson.h> //使用Json文件格式做配置文件
#include "FS.h"          //ESP8266开发板自带4MB闪存空间,可以用来读写存删文件

//----------------点灯科技 物连网 外网控制-填你自已的 独立设备密钥-----------------------
// arduino 菜单->项目->加载库->管理库 搜 Blinker 安装.
#define BLINKER_WIFI        // ESP8266,使用WIFI无线网络连互连网到点灯物连网服务器
#define BLINKER_WITHOUT_SSL // ESP8266 堆栈不足要采用非SSL加密方式连网通信
#include <Blinker.h>        //引用 点灯科技 物连网功能库,可以外网控制机械臂
String BlinKey = "";        // 点灯.blinker APP里创建 独立设备的密钥 填这里

// 新建组件对象
BlinkerText Text1("IP");             // 标签   组件对象 对象名,无事件
BlinkerText Text2("RSSI");           // 标签   组件对象 对象名,无事件
BlinkerSlider Slider1("X");          // 滑动条
BlinkerSlider Slider2("Y");          // 滑动条
BlinkerSlider Slider3("Z");          // 滑动条
BlinkerSlider Slider4("E");          // 滑动条
BlinkerSlider Slider5("B");          // 滑动条
BlinkerSlider Slider6("T");          // 滑动条
#include <Ticker.h>                  //定时器 功能库.帮助点灯APP里的按钮按住每秒转10度
Ticker timer;                        // 定时器 对象每100毫秒执行一次,1秒10次。。
int pressed[6] = {0, 0, 0, 0, 0, 0}; //-1 0 +1 定时器扫描这个变量,让各舵机连续转动
//---------------------------------------------------------------------------------

#include <Servo.h>                              //引用 舵机 功能库头文件
Servo S[6];                                     // 创建舵机对象
int ss = 4;                                     // 4=4轴,5=5轴,其他值或6=6轴6舵机械臂.此变量值决定使用下面数组几个成员值
char XYZE[6] = {'X', 'Y', 'Z', 'E', 'B', 'T'};  // 定义6个电机从底座到夹子为 XYZBTE.5轴没有T舵机
int pin[6] = {D2, D3, D0, D8, D5, D6};          // 开发板的数字针脚用来接6个电机.5轴没有T舵机
int rawdms[6] = {90, 90, 90, 90, 90, 90};       // 原点,起点,通电后或H指令会让所有舵机归位到此脉宽.500=0度，1500=居中90度，2500=180度
int olddms[6] = {90, 90, 90, 90, 90, 90};       // 每次转动舵机后保存脉宽值到此,作为下次转动的起点.
int newdms[6] = {90, 90, 90, 90, 90, 90};       // 每次转动舵机后保存脉宽值到此,作为下次转动的起点.
int mindms[6] = {0, 50, 90, 10, 0, 0};          // 定义6个电机在机械臂中可转动的最小信号脉冲微秒值
int maxdms[6] = {180, 180, 180, 100, 180, 180}; // 定义6个电机在机械臂中可转动的最大信号脉冲微秒值

bool Step = true;         // true=减速(1角度1角度的转),false=0=舵机原速转动
float factor = 11.11;     // 11.11=(2500-500)/180度
volatile int Autorun = 0; // 自动运行动作指令开关  0=不运行,>0为循环运行次数
String Cmd, Cmdret = "";  // 把一些指令放在这个变量,下次loop循环时执行

//---------------把 0-180 角度值转为对应高电平脉冲信号时间宽度 ---------------
int todms(float V)
{ // 返回  把角度值转换为脉冲宽度值
  if (V < 360.0)
  { // 值少于360视为角度,否则视为脉宽
    V = V * factor;
    if ((float)(V - (int)V) >= 0.45)
      V = V + 1.0;
    return 500 + (int)V; // 180度舵机取值0~180间并转为脉宽
  }
  else
  {
    return constrain((int)V, 500, 2500); // 取值500~2500间,9克舵机都是这个
  }
}
//----------------------------------------------------------------------
// 舵机对信号是单向处理的,可以发命令给舵机要求转到某个角度.
// 但舵机有没有转到那个位置和目前的状态是不会返回给我们的..
// 所以需要自已用变量保存上次的角度与现在要转到的角度..
//--------------函数 Servo180( )----调用Servo.h里的功能控制舵机转动-------------
bool Servo180(int I, int Value)
{                // 脉宽高电平 500微秒 到 2500微秒 之间，对应舵机0°～180°可转角度
  int count = 0; // 对应的角度值

  //------------------------------------------------------------------------
  if (I >= 0 && I < ss)
  {
    if (newdms[I] != olddms[I])
    {                  // 检查上次设置的该舵机新角度是否已执行
      Servo180(-1, 0); // 若未执行,则立即执行
    }
    newdms[I] = constrain(todms(Value), mindms[I], maxdms[I]); // 转为脉宽数值存入

    if (ss == 4)
      Servo4(I); // 四轴机械臂 限制Y轴与Z轴最大钝角与最小锐角,与装配角度有关
    return false;
  }

  //----------------------------------------------
  unsigned long ms = millis(); // 记录板子启动到现在的时间
  int J = 0, maxms = 0;
  do
  {
    J = 0;
    for (I = 0; I < ss; I++)
    { // 检查所有舵机,找出要转动的
      if (newdms[I] != olddms[I])
      {                                         // 新旧值不同,需要发信号转动
        int range = abs(newdms[I] - olddms[I]); // 计算当前转到目标的脉宽差
        maxms = max(maxms, range);              // 支持多舵机同时转动,记下最耗时间
        if (Step && range > (int)factor)
        { // 需要减速即逐角度转动
          if (newdms[I] > olddms[I])
          {
            olddms[I] += (int)factor; // 正转1度
          }
          else
          {
            olddms[I] -= (int)factor; // 反转1度
          }
          S[I].write(olddms[I]); // 发送信号
          delay(1);
        }
        else
        {
          S[I].write(newdms[I]); // 原速转动,直接发送目标脉宽信号
          olddms[I] = newdms[I]; // 保存新的脉宽
        }
      }
      else
        J++;
    }
  } while (J != ss);

  // 空载速度：0.12秒/60度(4.8V) = 120毫秒60度 = 2毫秒1度 = 2000微秒1度 = 2000微秒转11脉宽(转1脉宽信号需要消耗182微秒)
  ms = maxms / (int)factor * 2 + ms;
  if (ms > millis())
  { // 检查目前已消耗的时间与转到目标角度需要的时间
    delay(constrain(ms - millis(), 0, 400));
  }
  // yield()=delay(0)延时可避免长时间循环触发看门狗重启开发板.Soft WDT reset
  // 循环超过500MS易触发看门狗重启开发板..重置看门狗计数 ESP.wdtFeed();禁止看门狗 ESP.wdtDisable() 超过5秒触发硬件看门狗

  return maxms != 0; // 有发送过舵机信号返回 true
}

