qiaoliang/arduino-learning/ESP8266/1-4-File_WIFI/src/main.cpp
void Servo4(int I)
{ //-----四轴机械臂 限制Y轴与Z轴最大钝角与最小锐角,与舵机装配角度有关---
  int v = newdms[1] + newdms[2];
  if (I == 1)
  { // 控制Y角度
    if (v < 3350)
    { // Y+Z 锐角小于3350脉宽,限值3350;约 30度
      newdms[2] += 3350 - v;
      if (newdms[2] > maxdms[2])
        newdms[1] += newdms[2] - maxdms[2];
    }
    if (v > 4550) // Y+Z 钝角大于4550脉宽,限值4550;约140度
      newdms[2] -= v - 4550;
    if (mindms[2] > newdms[2])
      newdms[1] -= mindms[2] - newdms[2];
  }
  if (I == 2)
  {               // 控制Z角度
    if (v < 3350) // Y+Z 锐角小于3350脉宽,限值3350;
      newdms[1] += 3350 - v;
    if (newdms[1] > maxdms[1])
      newdms[2] += newdms[1] - maxdms[1];
    if (v > 4550) // Y+Z 钝角大于4550脉宽,限值4550;
      newdms[1] -= v - 4550;
    if (mindms[1] > newdms[1])
      newdms[2] -= mindms[1] - newdms[1];
  }
}

//-------------------------点灯科技 物连网 控制-----------------------------------
// 点灯APP里创建的独立设备,组件被触发又未绑定专用事件处理函数的,会执行这个函数
void dataRead(const String &data)
{                                             // Blinker.attachData(dataRead) {"X":109}
  BLINKER_LOG("dataRead 未附加事件: ", data); //{"X++":"tap"} {"X--":"press"} {"X--":"pressup"}  x70;y30
                                              // 按键名:点击     按键名:按住       按键名:松开        滑块和调试组件发来的命令
  Autorun = 0;                                // 有任何命令时停止自动脚本
  String S = String(data);
  int i = S.indexOf("\"", 0); // 区分是按钮事件,还是调试组件发来的控制命令
  if (i > 0)
  {
    S.remove(0, i + 1);
    int j = S.indexOf("\":\"", 0);
    if (j > 0)
    {
      S.remove(j); // 提取组件名,当机械臂控制命令用
    }
    else
    {
      S.remove(S.indexOf("\":", 0), 2);
      S.remove(S.lastIndexOf("}"));
    }
  }
  //--------------------------------------------
  if (S.equalsIgnoreCase("IP"))
  { // 查IP
    Text1.print(WiFi.localIP().toString().c_str());
    Text2.print("RSSI:" + String(WiFi.RSSI()) + "dBm"); // WIFI信号强度
    return;
  }

  BLINKER_LOG(S); // 串口输出指令内容
  Cmd = S;        // 把未识别指令存到变量,供下次LOOP循环时转给Command()执行
  Blinker.print("millis", millis());
}
void heartbeat()
{
  // BLINKER_LOG("heartbeat 心跳");
  static bool first = false; // True or false
  if (!first)
  { // 首次通信把IP与信号强度发给服务器
    first = true;
    Text1.print(WiFi.localIP().toString().c_str());
    Text2.print("RSSI:" + String(WiFi.RSSI()) + "dBm"); // WIFI信号强度
  }
  // BLINKER_LOG(Cmdret);
  if (0 > Cmdret.indexOf("{"))
  { // 输出上次执行Cmd变量里的指令结果
    Blinker.print("message", Cmdret);
    Cmdret = "";
  }
  Slider1.print(map(newdms[0], 500, 2500, 0, 180)); // 输出各轴舵机当前角度
  Slider2.print(map(newdms[1], 500, 2500, 0, 180));
  Slider3.print(map(newdms[2], 500, 2500, 0, 180));
  Slider4.print(map(newdms[3], 500, 2500, 0, 180));
  if (ss > 4)
    Slider5.print(map(newdms[4], 500, 2500, 0, 180));
  if (ss > 5)
    Slider6.print(map(newdms[5], 500, 2500, 0, 180));
}
// 物连网 点灯科技APP 滑动进度条会执行下列事件
void sliderX(int32_t value) { dataRead("X" + String(value)); }
void sliderY(int32_t value) { dataRead("Y" + String(value)); }
void sliderZ(int32_t value) { dataRead("Z" + String(value)); }
void sliderE(int32_t value) { dataRead("E" + String(value)); }
void sliderB(int32_t value) { dataRead("B" + String(value)); }
void sliderT(int32_t value) { dataRead("T" + String(value)); }

//-----------------------------------------------------------------------
//-----------------------------------------------------------------------
ICACHE_RAM_ATTR void ISR() { Autorun = 1; } // D1中断事件处理
//-----------------------------------------------------------------------
//------------------开发板通电后初始函数 setup()----------------------------
void setup()
{
  Serial.begin(115200);                                    // 开启串口通信 波特率115200,串口监视器也要相同波特率,不然会乱码
  pinMode(LED_BUILTIN, OUTPUT);                            // 初始化8266开发板LED信号灯的GPIO口为输出.
  digitalWrite(LED_BUILTIN, LOW);                          // Mini ESP8266板LED_BUILTIN=GPIO 2,LOW=亮灯,HIGH=灭灯
  Serial.printf("\nsetup  LED_BUILTIN:%d\n", LED_BUILTIN); // 输出LED信号灯用的 芯片GPIO编号
  // 注意:Mini D1 ESP8266开发板LED_BUILTIN=GPIO2=D4,为避免冲突,舵机信号线不要插到D4去,上面数组里也没用D4.

  //------------ arduino 菜单->工具->Flash Size->4MB(FS:2MB OTA:1019KB) -----------------
  // ESP8266开发板代码.格式化并建立内置闪存文件系统,用来保存 Auto.txt 等机械臂自动化动作指令
  // SPIFFS.format();         //第一次使用 格式化SPIFFS,可清除所有内容
  SPIFFS.begin();    // 开启闪存文件系统
  FSInfo info;       // 信息
  SPIFFS.info(info); // 取闪存文件系统信息

  Serial.printf("\n闪存.已用:%d字节;可用:%d字节;", info.usedBytes, info.totalBytes); // 已用空间,可用空间
  // Serial.printf("块大小:%d  页大小:%d",info.blockSize,info.pageSize);                   //存储块大小,存储页大小
  // Serial.printf("最长文件名:%d  最多可打开:%d\n",info.maxPathLength,info.maxOpenFiles);  //最长文件名,最多可打开文件

  loadConfig(); // 载入配置文件(如果有),替换一些变量值
  //-------------设置舵机数字插口与脉冲宽度微秒时间,驱动舵机到初始角度---------------
  if (ss != 4 && ss != 5)
    ss = 6; // ss 决定程序控制是几轴机械臂
  if (ss == 4 && todms((float)rawdms[2]) < 2000)
    rawdms[2] = 2490; // 四轴Z舵机默认在 180度 位置
  for (int I = 0; I < ss; I++)
  {
    S[I].attach(pin[I], 500, 2500); // 绑定针脚,设置信号脉冲宽度范围//S[I].detach();
    rawdms[I] = todms((float)rawdms[I]);
    olddms[I] = rawdms[I]; // rawdms变量拷贝给olddms变量
    newdms[I] = rawdms[I]; // rawdms变量拷贝给newdms变量
    mindms[I] = todms((float)mindms[I]);
    maxdms[I] = todms((float)maxdms[I]);
    S[I].write(rawdms[I]); // 写入新角度值,控制舵机转动
    delay(500);            // 等待该舵机转到目标角度.
  }

  pinMode(D1, OUTPUT); // 设置D1为输出模式
  //---使用D1引脚为脚本启动开关,当D1与 5V正极接触,中断调用 ISR 设置 Autorun=1 运行 Auto.txt 动作脚本文件-----
  digitalWrite(D1, LOW);                                   // 设置D1为低电平 LOW状态
  attachInterrupt(digitalPinToInterrupt(D1), ISR, RISING); // 启用硬件中断实时捕获 D1 引脚低电平LOW变为高电平HIGH
  //---使用D1引脚为脚本启动开关,当D1与GND负极接触,中断调用 ISR 设置 Autorun=1 运行 Auto.txt 动作脚本文件-----
  // digitalWrite(D1,HIGH);                //设置D1为高电平HIGH状态
  // attachInterrupt(digitalPinToInterrupt(D1),ISR,FALLING);//启用硬件中断实时捕获 D1 引脚高电平HIGH变为低电平LOW
  // CHANGE（改变沿，电平从低到高或者从高到低）、RISING（上升沿，电平从低到高）、FALLING（下降沿，电平从高到低）

  //-----------------------下面是连接WIFI网络.可以连路由器或电脑与手机的创建的热点网络--------------------
  WiFi.mode(WIFI_AP_STA); // WIFI_STA=客户端模式，WIFI_AP=热点模式
  if (STA_SSID != "" && STA_PSK != "")
  {
    Serial.printf("\n连接WIFI.SSID:%S 密码:%S\n", STA_SSID, STA_PSK); // 输出要连到的热点
    WiFi.begin(STA_SSID, STA_PSK);                                    // 开发板连 路由器,手机或电脑创建WIFI无线热点,也可开网页控制机械臂
    for (int i = 0; i < 15; i++)
    { // 循环十五次共15秒.若连网成功就跳出循环
      if (WiFi.status() == WL_CONNECTED)
      {                                // 成功连网
        IPAddress IP = WiFi.localIP(); // 获取 DHCP 分配的随机IP地址 192.168.X.X
        String S = IP.toString();      // 转为字符串IP地址
        // unsigned int V4=IP.v4();        //提取32位的IP地址
        /*
        S.remove(S.lastIndexOf(".")+1);   //提取IP前面字符串 "192.168.X."
        for(int i=6;i<10;i++){            //"192.168.X." + "6" "7" "8" "9"修改末位为做静态地址
           IP.fromString(S+String(i));    //新IP存入变量
           if(WiFi.config(IP,WiFi.gatewayIP(),WiFi.subnetMask())){    //尝试设置静态IP
              break;                      //设置静态IP成功,跳出循环
           }
        }
        IP=WiFi.localIP(); //重新提取静态IP地址,可能是 192.168.1.6  192.168.31.6  192.168.43.6
        S=IP.toString();
        */
        Serial.printf("IP:%s", S.c_str()); // 输出连网得到的IP地址
                                           // 很多手机做移动热点时不显示IP地址
        File F = SPIFFS.open("/ip.txt", "w"); //"w"=重写文件所有内容
        F.print(S);
        F.close(); // 保存IP到文件可供查阅;关闭文件

