qiaoliang/arduino-learning/ESP8266/1-4-File_WIFI/src/main.cpp
        S.replace(".", "-"); // 把 192.168.X.X 转成 192-168-X-X 设为网络主机名称
        WiFi.hostname(S);    // 修改的名称不一定成功显示.多刷新几次手机里已连接设备 查看
        break;               // 连网成功,跳出循环;在同网络里 手机或电脑打开 http://ip/ 就能控制机械臂
      }
      Serial.print(".");
      digitalWrite(LED_BUILTIN, HIGH); // 灭灯
      delay(500);                      // 延时500毫秒
      digitalWrite(LED_BUILTIN, LOW);  // 亮灯
      delay(500);                      // 延时500毫秒
    }
  }
  digitalWrite(LED_BUILTIN, LOW); // 亮灯

  //----------------创建WIFI热点.手机电脑连这个热点后打开 http://192.168.1.1/ 就能控制机械臂------------
  if (WiFi.status() != WL_CONNECTED)
    WiFi.mode(WIFI_AP);                                                      // 如果连网失败改为纯AP模式
  WiFi.softAPConfig({192, 168, 1, 1}, {192, 168, 1, 1}, {255, 255, 255, 0}); // 配置开发板IP,网关与子网掩码.
  if (WiFi.softAP(AP_SSID, AP_PSK))
  { // 开启WIFI_AP无线网络,热点 与 密码
    Serial.printf("\n创建WIFI.SSID:%S", WiFi.softAPSSID());
    Serial.printf(" 密码:%S", WiFi.softAPPSK());
    Serial.printf(" IP:%s", WiFi.softAPIP().toString().c_str());
    // Serial.print("MAC );Serial.println(WiFi.softAPmacAddress());
  }

  //--------------开启WEB网页服务器.支持网页控制------------------------------------------
  Web.on("/command", HTTP_GET, command);              // 机械臂指令处理回调函数  http://IP/command?x++;Y100;Z90
  Web.on("/upload.html",                              // 上传文件upload页面.   http://IP/upload.html 可以上传 index.html 等网页文件
         HTTP_POST,                                   // POST方式向服务器上传文件
         FileUpload_OK,                               // 回复状态码OK=200给客户端  //[](){Web.send(200);}
         handleFileUpload);                           // 并且运行处理文件上传函数
  Web.onNotFound(handleUserRequest);                  // 对于未定义请求统统让他处理
  Web.on("/config", HTTP_GET, Config);                // 机械臂设置处理回调函数  http://IP/config
  Updater.setup(&Web, "/upbin", "admin", "12345678"); // 开启网络更新固件服务,帐密登陆 http://IP/upbin 第一项Firmware固件更新
  Web.begin(80);                                      // 启动WEB服务器
  Serial.println("\nWeb 网页控制服务器开启");

  //---------------------------初始化 点灯.科技 物连网 外网控制 功能-----------
  if (WiFi.status() == WL_CONNECTED && 6 < BlinKey.length())
  {
    BLINKER_DEBUG.stream(Serial); // 绑定调试信息输出串口对象
    BLINKER_LOG("Blinker");

    char KEY[16], SID[32], PSK[32];
    BlinKey.toCharArray(KEY, 16);  // 转为字符数组保存
    STA_SSID.toCharArray(SID, 32); // 转为字符数组保存
    STA_PSK.toCharArray(PSK, 32);  // 转为字符数组保存
    Blinker.begin(KEY, SID, PSK);
    Blinker.setTimezone(8.0);           // 设置时区, 如: 北京时间为+8:00
    Blinker.attachData(dataRead);       // 附加 默认回调函数
    Blinker.attachHeartbeat(heartbeat); // 附加 心跳回调函数,每30s-60会发送一次心跳包

    Slider1.attach(sliderX); // 附加 滑动条  事件
    Slider2.attach(sliderY); // 附加 滑动条  事件
    Slider3.attach(sliderZ); // 附加 滑动条  事件
    Slider4.attach(sliderE); // 附加 滑动条  事件
    if (ss > 4)
      Slider5.attach(sliderB); // 附加 滑动条  事件
    if (ss > 5)
      Slider6.attach(sliderT); // 附加 滑动条  事件
  }
}
//-----------------------------------------------------------------------
//
//
//
//------------------载入配置文件，修改一些变量数据参数------------------------
void loadConfig()
{                                            // 载入配置文件/config.json替换掉一些变量中的值
  File F = SPIFFS.open("/config.json", "r"); // 打开读取配置文件
  F.seek(0);                                 // 到首位置
  String S = F.readString();                 // 读入文本
  F.close();                                 // 关闭文件

  if (S.length() > 32)
  {
    // StaticJsonDocument<1024> doc;          //栈内存JSON文档对象
    DynamicJsonDocument doc(2048); // 堆内存JSON文档对象
    deserializeJson(doc, S);       // 把内容装载到JSON对象
    // serializeJson(doc, Serial);              //输出JSON格式内容到串口
    // Serial.println();                        //输出换行符

    AP_SSID = String(doc["AP_SSID"]); // 读取配置参数到变量
    AP_PSK = String(doc["AP_PSK"]);
    STA_SSID = String(doc["STA_SSID"]);
    STA_PSK = String(doc["STA_PSK"]);

    BlinKey = String(doc["BlinKey"]); // 物联网 点灯.blinke 独立设备 密钥..

    ss = doc["ss"]; // ss 4=4轴机械臂,5=5轴机械臂,其他值或6=六轴机械臂

    for (int I = 0; I < ss; I++)
    {                                  // 读取舵机参数到数组变量
      const char *C = doc["Servo"][I]; // 舵机编号
      XYZE[I] = *C;
      pin[I] = doc["pin"][I];                     // 舵机GPIO
      rawdms[I] = todms(float(doc["rawdms"][I])); // 原脉宽 1500=居中90度
      mindms[I] = todms(float(doc["mindms"][I])); // 最小脉宽微秒值
      maxdms[I] = todms(float(doc["maxdms"][I])); // 最大脉宽微秒值
    }
    Autorun = doc["Autorun"]; // 板子通电自动运行Auto.txt次数
    doc.clear();
  }
}
//-------------------------------------------------------------
String output()
{                              // 返回Json格式的所有舵机当前角度信息
  StaticJsonDocument<256> doc; // 栈内存JSON文档对象

  for (int I = 0; I < ss; I++)
  {
    String s = String(XYZE[I]); // 舵机编号
    float v = (float)(newdms[I] - 500.0) / factor;
    doc[s] = String(v, 1); // 输出带1位精度的角度值
  }
  String ret;
  serializeJson(doc, ret); // 单行格式 到变量
  // serializeJsonPretty(doc,ret);           //多行格式 到变量
  doc.clear();
  return ret; //{"X":90,"Y":90,"Z":90,"E":90,"B":90,"T":90}
}

//-----------------------------------------------------------------
//
//
//
//------------------开发板循环调用函数 loop()------------------------
void loop()
{
  if (6 < BlinKey.length())
    Blinker.run();    // 处理 点灯科技 物连网 通信数据
  Web.handleClient(); // 处理客户HTTP访问,上传文件,更新固件

  if (Autorun != 0)
  {                        // 开启循环执行Auto文件命令
    Command("R Auto.txt"); // 执行 R 命令
    if (Autorun > 0)
      Autorun--; // 正数减1次,负数不变
  }
  if (Cmd != "")
  {                      // 如果cmd全局变量里有未执行命令,现在执行
    Cmdret = split(Cmd); // 分析指令并调用Command执行
    Cmd = "";
  }

  //---------------监听电脑串口输入指令-------------------
  if (Serial.available() > 0)
  {                                 // 有串口数据>0字节
    String t = Serial.readString(); //?SDCHRA XYZBTE
    t.trim();                       // 删首尾空格与换行
    // t.toUpperCase();                          //指令转为大写
    Serial.println(t); // 串口回显指令
    Autorun = 0;       // 有命令时停止动作
    Serial.println(split(t));
  }
}

//---------------------------------------------------
// 舵机控制命令支持 单个执行也支持多个同时执行
// 单命令   X50
// 多命令   X50;Y100;Z100
// 多行命令 X50;Y100\nZ100;E80
//---------------------------------------------------
String split(String t)
{ // 拆分多行命令 或以 ; 为分隔的多个命令
  String ret = "";
  long i[2] = {0}; //[0]=; [1]=\n
  do
  {
    i[0] = t.indexOf(";", 0);  // 查找分隔符 ;
    i[1] = t.indexOf("\n", 0); // 查找换行符 \n
    if (i[0] == -1 && i[1] == -1)
    { // 没找到符号
      ret = Command(t);
      break; // 单个指令执行跳出
    }
    else if (i[0] != 0 && i[1] == -1)
    {                                      // 单行有 ; 分隔的多个指令
      ret = Command(t.substring(0, i[0])); // 提取一个指令执行
      t.remove(0, i[0] + 1);               // 删除已执行的指令
    }
    else if (i[1] != 0 && i[0] == -1)
    {                                      // 多行的 无分隔的单个指令
      ret = Command(t.substring(0, i[1])); // 提取单行指令执行
      t.remove(0, i[1] + 1);               // 删除已执行的此行
      if (Servo180(-1, 0))
        Serial.println(output());
    }
    else if (i[0] < i[1])
    {                                      // ; 在 \n 之前
      ret = Command(t.substring(0, i[0])); // 提取一个指令执行
      t.remove(0, i[0] + 1);               // 删除已执行指令
    }
    else if (i[0] > i[1])
    {                                      // \n 在 ; 之前
      ret = Command(t.substring(0, i[1])); // 提取一行指令执行
      t.remove(0, i[1] + 1);               // 删除已执行指令
      if (Servo180(-1, 0))
        Serial.println(output());
    }
    else
      break;
  } while (t.length() > 0); // 未查找完 继续循环
  if (ret == "")
    if (Servo180(-1, 0))
      ret = output();
  return ret;
}

//------------------------------------------------------------------------
//
//
//
//-----------------解析并执行命令 已定义常用命令 ?SDCHRA XYZBE----------------
String Command(String t)
{
  static int dms[6] = {0};          // 静态变量,存放上次S保存过的电机位置
  static String file = "/Auto.txt"; // 静态变量,存放FSDRC命令将操作的文件

