qiaoliang/arduino-learning/ESP8266/1-4-File_WIFI/src/main.cpp
  int i = 0, j = 0, v = 0; // 定位指令文本中位置
  String Auto;             // Auto.txt文件内容
  String S = "";           // 保存命令所带的参数
  String ret = "";         // 返回结果

  //-------------------拆分以空格分隔的命令与参数------------------
  t.trim();              // 删首尾空格与换行
  i = t.indexOf(" ", 0); // 查找空格 拆分命令与参数
  if (i > 0)
  {
    S = t.substring(i + 1); // 提取参数
    S.trim();               // 删首尾空格与换行
    t.remove(i);            // 保留命令,删除参数
    // Serial.println("Command.命令:s% 参数:s%\n",t,S);//串口输出拆分出来的命令和参数
  }

  //----------------解析执行一些命令 ?SDCHRA --------------------------------
  if (t.equalsIgnoreCase("RE"))
  {                // re 重启开发板
    ESP.restart(); // 软重启
    return "";
  }
  if (t == "?" || t == "？")
  { // ？HELP 输出简要的帮助信息
    if (S == "")
      S = "/HELP.txt"; //? Auto 输出指定文件的内容
    if (!S.startsWith("/"))
      S = "/" + S; // 比较字符串前缀
    if (1 > S.indexOf(".", 1))
      S = S + ".txt";             // 比较字符串后缀
    File F = SPIFFS.open(S, "r"); //"r"=只读内容,"w"=重写内容
    F.seek(0);                    // 到首位置
    ret = F.readString();         // 读入文本
    F.close();                    // 关闭文件
    return ret;
  }
  if (t.startsWith("//"))
  { // 跳过动作文件中的备注行
    return "";
  }
  if (t.equalsIgnoreCase("F"))
  { // 用 "F Auto.txt" 改变动作文件名
    if (S == "")
      S = "/Auto.txt"; // 用 "F test.txt" 指定动作文件名
    if (!S.startsWith("/"))
      S = "/" + S; // 比较字符串前缀
    if (1 > S.indexOf(".", 1))
      S = S + ".txt";                    // 比较字符串后缀
    file = S;                            // 保存文件名 R S D C 将对该文件操作
    return ("{\"F\":\"" + file + "\"}"); // 输出新动作文件名称
  }
  if (t.equalsIgnoreCase("delay"))
  {                              // 动作脚本中 delay xx 由这段代码执行
    int v = S.toInt();           // delay的参数,即是要延时的毫秒时间
    unsigned long ms = millis(); // 板子开机已经过的毫秒时间
    Servo180(-1, 0);
    while (millis() - ms < v)
    { // 在要延时的毫秒时间里一直循环
      delay(0);
      if (0 < BlinKey.length())
        Blinker.run();
      Web.handleClient(); // 处理客户HTTP访问,上传文件,更新固件
    }
    return "";
  }
  if (t.equalsIgnoreCase("SH"))
  {                                      // 保存XYZBTE舵机当前位置到 H.txt 文件
    File F = SPIFFS.open("/H.txt", "w"); //"w"=重写文件所有内容
    F.seek(0);                           // 到首位置
    for (int I = 0; I < ss; I++)
    { // 循环所有舵机变量进行输出保存
      float f = (float)(newdms[I] - 500) / factor;
      F.printf("%c%.1f\n", XYZE[I], f); // 保存新位置到文件
    }
    F.close(); // 关闭文件
    return Command("? /H.txt");
  }
  if (t.equalsIgnoreCase("H"))
  { // HOME 让XYZBTE六个电机到指定位置
    if (SPIFFS.exists("/H.txt"))
    { // 如果有 H.txt 则执行
      Command("R H.txt");
      return output();
    }
    else
      for (int I = 0; I < ss; I++)
      { // 无 H.txt 则执行rawdms变量值
        Servo180(I, rawdms[I]);
      }
    Servo180(-1, 0);
    return output();
  }
  if (t.equalsIgnoreCase("Test"))
  { // 执行一段底座左右转动的测试动作
    ret = Test();
    return ret;
  }
  if (t.equalsIgnoreCase("S"))
  { // 保存XYZETB电机新角度指令到自动执行文件
    ret = "";
    if (S.toInt() > 0)
    {                                     // S xx 转为 delay xx 保存到文件
      ret = "delay " + String(S.toInt()); // 保存delay xx到文件
    }
    else if (S != "")
    {          // S delay xx 保存 delay xx  到文件
      ret = S; // S Y1500;S R test.txt;直接存到文件
    }
    else
      for (int I = 0; I < ss; I++)
      { // 判断位置发生变化的所有舵机并保存
        if (dms[I] != newdms[I])
        { // 判断位置与上次保存后有无发生变化
          // dms[I]=map(newdms[I],500,2500,0,180);  //转为角度值输出
          if (ret != "")
            ret += ";"; // 如果有多个舵机有转动过,添加 ; 分隔符
          float f = (float)(newdms[I] - 500) / factor;
          ret += XYZE[I] + String(f, 1); // 保存新位置到文件
          dms[I] = newdms[I];            // 保存新的X位置下次判断用
        }
      }
    if (ret != "")
    {                                  // 有 待追加命令
      File F = SPIFFS.open(file, "r"); //"r"=读取内容
      F.seek(0);                       // 到首位置
      Auto = F.readString();           // 读入文本
      Auto.trim();                     // 删首尾空格与换行
      F.close();                       // 关闭文件

      F = SPIFFS.open(file, "w"); //"w"=重写文件所有内容
      F.println(Auto);            // 先保存原指令
      F.println(ret);             // 再追加新指令
      F.flush();
      F.close(); // 结束关闭文件
    }
    return ret; // 返回信息串口输出新指令
  }
  if (t.equalsIgnoreCase("D"))
  {                                  // D 1 删除最后一行;  D 3 删除多行动作指令
    File F = SPIFFS.open(file, "r"); //"r"=只读内容,"w"=重写内容
    F.seek(0);                       // 到首位置
    Auto = F.readString();           // 读入文本
    Auto.trim();                     // 删首尾空格与换行
    F.close();                       // 关闭文件

    v = S.toInt(); // D 3 删除末尾3行
    if (v < 1)
      v = 1;
    for (; v > 0; v--)
    {                             // 循环次数是要删除几行
      i = Auto.lastIndexOf("\n"); // 倒找换行符
      if (i < 0)
        i = 0;        //-1=无换行符(改0,删除所有内容)
      Auto.remove(i); // 删除i后面的文本
    }

    F = SPIFFS.open(file, "w"); //"w"=重写文件所有内容
    F.seek(0);                  // 到首位置
    F.print(Auto);              // 保存剩余指令到文件
    F.close();                  // 关闭文件
    return Auto;                // 输出删行后的剩余 动作指令
  }
  if (t.equalsIgnoreCase("C"))
  { // C Auto;C test;清空指定文件内容并删除文件
    if (S == "")
      S = file; // 参数若未指令文件，删除file
    if (!S.startsWith("/"))
      S = "/" + S; // 比较字符串前缀
    if (1 > S.indexOf(".", 1))
      S = S + ".txt"; // 比较字符串后缀
    SPIFFS.remove(S); // 删除文件
    dms[6] = {0};
    return S; // 输出删除的文件
  }
  if (t.equalsIgnoreCase("step"))
  { // 改变舵机速度,step 0=原速,step 1=减速;
    Step = 0 != S.toInt();
    return "Step:" + String(Step); //
  }
  if (t.equalsIgnoreCase("format"))
  {                    // 格式化 开发板闪存文件系统 清除所有文件,需要重新上传
    SPIFFS.format();   // 格式化
    FSInfo info;       // 信息
    SPIFFS.info(info); // 取闪存文件系统信息
    ret = "闪存.已用:" + String(info.usedBytes) + "字节;可用:" + String(info.totalBytes) + "字节;";
    return ret;
  }
  if (t.equalsIgnoreCase("UP"))
  { // UP and down  你想写啥就写啥,别问我
    Servo180(-1, 0);
    ret = "UP..";
    return ret;
  }
  if (t.equalsIgnoreCase("DIR"))
  {                    // 枚举文件并输出
    FSInfo info;       // 信息
    SPIFFS.info(info); // 取闪存文件系统信息
    ret = "闪存.已用:" + String(info.usedBytes) + "字节;可用:" + String(info.totalBytes) + "字节;\n";

