qiaoliang/arduino-learning/ESP8266/1-4-File_WIFI/src/main.cpp
    Dir dir = SPIFFS.openDir("/"); // 打开根目录,枚举文件名
    while (dir.next())
    { // 循环所有对象
      ret += dir.fileName();
      File F = dir.openFile("r");
      ret += "\t";             // Tab 制表符
      ret += String(F.size()); // 取文件长度
      ret += "\n";
      F.close();
    }
    return ret; // 返回输出所有枚举到的文件信息
  }

  if (t.equalsIgnoreCase("R"))
  {                // R   运行file变量指定文件的动作指令
    v = S.toInt(); // R 3 执行 Auto.txt 3次
    if (v != 0 && S == String(v))
    {              // R Auto   执行Auto.txt 1次
      Autorun = v; // R test   执行test.txt 1次
      return ret;  // 若 R 参数为整数,设置 Autorun 变量循环执行 Auto.txt 次数
    }
    if (S == "")
      S = file; // 参数若未指定文件,则执行file变量里的文件
    Auto = S;
  }
  else
    Auto = t; // 对于不可识别的指令尝试以动作文件执行,如 "Q" 变会成 "/Q.txt" 若存在则执行
  if (!Auto.startsWith("/"))
    Auto = "/" + Auto; // 比较字符串前缀
  if (1 > Auto.indexOf(".", 1))
    Auto = Auto + ".txt"; // 比较字符串后缀
  if (SPIFFS.exists(Auto))
  { // 判断动作文件是否存在.若有此文件则执行
    ret = "R " + Auto + "\n";
    // Serial.println(ret);
    if (Response && Auto != "/H.txt")
    {                                   // R指令判断是否有待应答网页请求
      Response = false;                 // 标记为已应答
      Web.send(200, "text/plain", ret); // 立即应答,避免长时间挂起网页
    }

    v = S.toInt();                          // Auto.txt 5 提取执行次数
    if (v < 1 || v > 256 || S != String(v)) //
      v = 1;                                // 不符合要求的次数重定为1次
    S = Auto;                               // 另存文件名称
    for (; v > 0; v--)
    {
      File F = SPIFFS.open(S, "r"); // 打开文件 "r"=只读取文件内容
      // F.seek(0);                     //到文件首位置
      Auto = F.readString(); // 读内容到变量
      F.close();             // 关闭文件

      // 拆分多行命令 或以 ; 为分隔的多个命令
      int Run = Autorun; // 要运行的次数,当值有改变时停止
      i = 0;
      j = 0; // i起始,j=;,v=\n
      do
      {
        i = Auto.indexOf(";", 0);  // 查找分隔符 ;
        j = Auto.indexOf("\n", 0); // 查找换行符 \n
        if (i == -1 && j == -1)
        { // 没找到符号
          Command(Auto);
          break; // 单个指令执行跳出
        }
        else if (i != 0 && j == -1)
        {                                // 单行有 ; 分隔的多个指令
          Command(Auto.substring(0, i)); // 提取一个指令执行
          Auto.remove(0, i + 1);         // 删除已执行的指令
        }
        else if (i == -1 && j != 0)
        {                                // 多行的 无分隔的单个指令
          Command(Auto.substring(0, j)); // 提取单行指令执行
          Auto.remove(0, j + 1);         // 删除已执行的此行
          Servo180(-1, 0);
        }
        else if (i < j)
        {                                // ; 在 \n 之前
          Command(Auto.substring(0, i)); // 提取一个指令执行
          Auto.remove(0, i + 1);         // 删除已执行指令
        }
        else if (i > j)
        {                                // \n 在 ; 之前
          Command(Auto.substring(0, j)); // 提取一行指令执行
          Auto.remove(0, j + 1);         // 删除已执行指令
          Servo180(-1, 0);
        }
        else
          break;
      } while (Auto.length() > 0 && Run == Autorun); //-1=没找到换行 或 运行次数发生变化,结束循环.
      Servo180(-1, 0);
    }
    // Serial.println("R end");
    return ret + output();
  }

  //----------解析XYZBTE电机指令  底座X 前后Y 上下Z 平衡B 旋转T 夹子E
  t.toUpperCase(); // 指令转为大写
  for (i = 0; i < ss; i++)
  { // 循环所有舵机
    if (XYZE[i] == t.charAt(0))
    { // 判断指令第1个字符为哪个电机
      if (t.length() == 1)
      { // X --;  X ++;  X 1500;
        if (S == "--")
        {
          v = newdms[i] - 1; // 新角度=旧角度-1度(约11微秒)
        }
        else if (S == "++")
        {
          v = newdms[i] + 1;
        }
        else
        {
          v = newdms[i] + S.toInt(); // tofloat
        }
        Servo180(i, v); // 执行电机指令
        // Serial.println(v);           //串口输出执行的指令
        return "";
      }

      if (t.charAt(2) == '-')
      {                              // X--    第3个字符
        v = newdms[i] - (int)factor; // 新角度=旧角度-1度(约11微秒)
      }
      else if (t.charAt(2) == '+')
      {                              // X++    第3个字符
        v = newdms[i] + (int)factor; // 新角度=旧角度+1度(约11微秒)
      }
      else if (t.charAt(1) == '-')
      {                     // X-?    第2个字符
        t = t.substring(2); // 提取第3个字符与后面的数字内容

        v = newdms[i] - (int)(t.toFloat() * factor); // 新角度=旧角度-N度(约11微秒)
      }
      else if (t.charAt(1) == '+')
      {                     // X+?    第2个字符
        t = t.substring(2); // 提取第3个字符与后面的数字内容
        float f = t.toFloat() * factor;
        if ((float)(f - (int)f) >= 0.45)
          f = f + 1.0;
        v = newdms[i] + (int)f; // 新角度=旧角度+N度(约11微秒)
      }
      else
      {                         // X??? 绝对定位
        t = t.substring(1);     // 提取第2个字符与后面的数字内容
        v = todms(t.toFloat()); // 新角度=数字内容值 或 新脉宽值
      }
      Servo180(i, v); // 执行电机指令
      // Serial.println(i);
      // Serial.println(v);           //串口输出执行的指令
      return "";
    }
  }
  return ret;
}

//---------------------------------------------------------------------------
// 收到 test 指令会执行这个测试程序,控制 X 和 E 舵机转动
// 可供参考用,自已编程使用 变量存取 与 逻辑条件 做复杂功能
//---------------------------------------------------------------------------
String Test()
{ // 一个简单的测试底座来回转到的功能

  Command("step 1"); // 设定为 减速
  Command("H");      // 所有舵机复位
  for (int i = 1; i < 6; i++)
  {
    Command("X" + String(90 + i * 10)); // X底座转向一侧
    Command("E-20");                    // E开夹20度
    if (i == 4)
      Command("Y+10");                  // 当左右转第4次时Y前顷10度
    Command("X" + String(90 - i * 10)); // X底座转向另一侧
    Command("E+20");                    // E闭夹20度
  }
  Command("H"); // 所有舵机复位
  return "Test()";
}

//---------------------------------------------------------------------------
//
//
//
//
//---------------接受机械臂网页控制指令函数 -------------------------------
void command()
{ // 网址里不能用 + 符号,会变成空格
  String message = "";
  /*
    message  ="command() ";
    message += "URI: ";
    message += Web.uri();
    message += "\n方法: ";
    message += (Web.method() == HTTP_GET) ? "GET" : "POST";
    message += "\n参数: ";
    message += Web.args();         //参数 数目
    message += "\n";
    for (int i=0;i<Web.args();i++) {                                  //枚举所有参数
      message += " " + Web.argName(i) + ":" + Web.arg(i) + "\n";  //参数名参数值
    }
    Serial.println(message);       //串口输出输信息
  */
  Autorun = 0; // 有任何命令时停止自动脚本
  if (Web.args() == 0)
  { // http://ip/command 无指令时返回所有舵机状态
    if (WiFi.status() == WL_CONNECTED)
    { // 成功连网
      IPAddress IP = WiFi.localIP();
      message = IP.toString() + "\n";
    }
    message += output();
  }

  Response = true;    // 标记需要应答
  static String date; // 静态变量时间戳

