qiaoliang/arduino-learning/ESP8266/1-4-File_WIFI/src/main.cpp
  for (int i = 0; i < Web.args(); i++)
  {                            // http://ip/command?x90&y90
    String t = Web.argName(i); // 提取一个指令
    if (t.equalsIgnoreCase("time"))
    {
      if (date != Web.arg(i))
        date = Web.arg(i);
      continue;
    }
    Serial.println(t); // 网页脚本XMLHttpRequest发来GET请求把"+"号变成" "空格,而" "空格还是" "空格.

    t.replace("_", "+"); // 把"_"恢复为"+"; 网页脚本arg=arg.replace(/\+/g ,"_"); //把'+'替换为'_'
    /*
    if(t.substring(1)=="   ")      {t.replace("   "," ++");} // 把 "X   " 恢复为 "X ++"
    else if(t.substring(1)=="  ")  {t.replace("  " ,"++");}  // 把 "X  "  恢复为 "X++"
    else if(t.substring(1,3)=="  "){t.replace("  " ," +");}  // 把 "X  5" 恢复为 "X +5"
    else if(t.substring(1,3)==" -"){ }                       // "X --","X -5","X -500"不做任何处理
    else if(t.substring(1,2)==" ") {t.replace(" " ,"+");}    // 把 "X 5","X 500" 改为 "X+5","X+500"
    */
    //    t.toUpperCase();             // 把指令转为大写
    Serial.print("HTTP指令:");
    Serial.println(t);
    message += "\n" + t + "\n";
    message += Command(t); // 解析 并 执行 命令
  }
  if (0 < Web.args())
    if (Servo180(-1, 0))
      message += output();
  Web.send(200, "text/plain", message);
  Response = false; // 标记已应答
}
//------------------保存一些变量数据参数到配置文件------------------------
//
//
//-------------------------------------------------------------------
void Config()
{ // 保存一些变量中的值到配置文件/config.json

  if (Web.args() > 0)
  {
    float v = 1.0;
    DynamicJsonDocument doc(2048);         // 堆内存JSON文档对象
    doc["AP_SSID"] = Web.arg("AP_SSID");   // 控制板要创建的WIFI热点
    doc["AP_PSK"] = Web.arg("AP_PSK");     // 控制板要创建的WIFI密码
    doc["STA_SSID"] = Web.arg("STA_SSID"); // 控制板要连接的路由器热点
    doc["STA_PSK"] = Web.arg("STA_PSK");   // 控制板要连接的路由器密码
    doc["BlinKey"] = Web.arg("BlinKey");   // 物连网 点灯APP 创建的独立设备密钥
    doc["ss"] = ss;

    doc["Servo"][0] = String(XYZE[0]); // 舵机编号
    doc["Servo"][1] = String(XYZE[1]); // 舵机编号
    doc["Servo"][2] = String(XYZE[2]); // 舵机编号
    doc["Servo"][3] = String(XYZE[3]); // 舵机编号
    doc["pin"][0] = pin[0];            // 舵机GPIO
    doc["pin"][1] = pin[1];            // 舵机GPIO
    doc["pin"][2] = pin[2];            // 舵机GPIO
    doc["pin"][3] = pin[3];            // 舵机GPIO

    rawdms[0] = todms(Web.arg("Xraw").toFloat());
    v = (float)(rawdms[0] - 500) / factor;
    doc["rawdms"][0] = String(v, 1); // 输出带1位精度的角度值
    rawdms[1] = todms(Web.arg("Yraw").toFloat());
    v = (float)(rawdms[1] - 500) / factor;
    doc["rawdms"][1] = String(v, 1); // 输出带1位精度的角度值
    rawdms[2] = todms(Web.arg("Zraw").toFloat());
    v = (float)(rawdms[2] - 500) / factor;
    doc["rawdms"][2] = String(v, 1); // 输出带1位精度的角度值
    rawdms[3] = todms(Web.arg("Eraw").toFloat());
    v = (float)(rawdms[3] - 500) / factor;
    doc["rawdms"][3] = String(v, 1); // 输出带1位精度的角度值

    mindms[0] = todms(Web.arg("Xmin").toFloat());
    v = (float)(mindms[0] - 500) / factor;
    doc["mindms"][0] = String(v, 1); // 输出带1位精度的角度值
    mindms[1] = todms(Web.arg("Ymin").toFloat());
    v = (float)(mindms[1] - 500) / factor;
    doc["mindms"][1] = String(v, 1); // 输出带1位精度的角度值
    mindms[2] = todms(Web.arg("Zmin").toFloat());
    v = (float)(mindms[2] - 500) / factor;
    doc["mindms"][2] = String(v, 1); // 输出带1位精度的角度值
    mindms[3] = todms(Web.arg("Emin").toFloat());
    v = (float)(mindms[3] - 500) / factor;
    doc["mindms"][3] = String(v, 1); // 输出带1位精度的角度值

    maxdms[0] = todms(Web.arg("Xmax").toFloat());
    v = (float)(maxdms[0] - 500) / factor;
    doc["maxdms"][0] = String(v, 1); // 输出带1位精度的角度值
    maxdms[1] = todms(Web.arg("Ymax").toFloat());
    v = (float)(maxdms[1] - 500) / factor;
    doc["maxdms"][1] = String(v, 1); // 输出带1位精度的角度值
    maxdms[2] = todms(Web.arg("Zmax").toFloat());
    v = (float)(maxdms[2] - 500) / factor;
    doc["maxdms"][2] = String(v, 1); // 输出带1位精度的角度值
    maxdms[3] = todms(Web.arg("Emax").toFloat());
    v = (float)(maxdms[3] - 500) / factor;
    doc["maxdms"][3] = String(v, 1); // 输出带1位精度的角度值
    if (ss >= 5)
    {
      doc["Servo"][4] = String(XYZE[4]); // 舵机编号
      doc["pin"][4] = pin[4];            // 舵机GPIO

      rawdms[4] = todms(Web.arg("Braw").toFloat());
      v = (float)(rawdms[4] - 500) / factor;
      doc["rawdms"][4] = String(v, 1); // 输出带1位精度的角度值

      mindms[4] = todms(Web.arg("Bmin").toFloat());
      v = (float)(mindms[4] - 500) / factor;
      doc["mindms"][4] = String(v, 1); // 输出带1位精度的角度值

      maxdms[4] = todms(Web.arg("Bmax").toFloat());
      v = (float)(maxdms[4] - 500) / factor;
      doc["maxdms"][4] = String(v, 1); // 输出带1位精度的角度值
    }
    if (ss == 6)
    {
      doc["Servo"][5] = String(XYZE[5]); // 舵机编号
      doc["pin"][5] = pin[5];            // 舵机GPIO

      rawdms[5] = todms(Web.arg("Traw").toFloat());
      v = (float)(rawdms[5] - 500) / factor;
      doc["rawdms"][5] = String(v, 1); // 输出带1位精度的角度值

      mindms[5] = todms(Web.arg("Tmin").toFloat());
      v = (float)(mindms[5] - 500) / factor;
      doc["mindms"][5] = String(v, 1); // 输出带1位精度的角度值

      maxdms[5] = todms(Web.arg("Tmax").toFloat());
      v = (float)(maxdms[5] - 500) / factor;
      doc["maxdms"][5] = String(v, 1); // 输出带1位精度的角度值
    }
    doc["Autorun"] = Web.arg("Auto").toInt(); // 板子通电自动运行Auto.txt次数
    doc["null"] = "null";
    Web.sendHeader("Location", "/index.html");
    Web.send(303); // 303跳转

    File F = SPIFFS.open("/config.json", "w"); // 创建重写文件
    serializeJson(doc, F);                     // 输出JSON格式内容到文件
    serializeJson(doc, Serial);                // 输出JSON格式内容到串口
    F.flush();
    F.close(); // 关闭文件
    doc.clear();

    ESP.restart(); // 软重启
  }
  //---------------------------------------------------------
  if (Web.args() == 0)
  {
    String html = "<!DOCTYPE html>";
    html += "<html lang='zh-CN'>";
    html += "<head>";
    html += "  <meta  charset='UTF-8'>";
    html += "  <title>创客与编程</title>";
    html += "  <style type='text/css'>";
    html += "    .txt{";
    html += "      width :50px;";
    html += "      height:20px;";
    html += "    }";
    html += "  </style>";
    html += "</head>";
    html += "<body>";
    html += "  <center>";

    html += "   <h1>创客与编程-机械臂固件配置</h1>";
    html += "   <p>警告:舵机不防堵,转不过去的角度需要最大最小限制,不然会发烫烧坏</P>";
    html += "   <form action='config' method='get'>";
    html += "    <p>";
    html += "    AP_SSID:<input type='text' name='AP_SSID' value='" + AP_SSID + "'>控制板要创建的 WIFI 热点名称<br>";
    html += "    &nbspAP_PSK:<input type='text' name='AP_PSK' value='" + AP_PSK + "'>控制板要创建的 WIFI 热点密码<br>";
    html += "    </p>";
    html += "    <p>";
    html += "    STA_SSID:<input type='text' name='STA_SSID' value='" + STA_SSID + "'>控制板要连接的路由器热点名称<br>";
    html += "    &nbspSTA_PSK:<input type='text' name='STA_PSK' value='" + STA_PSK + "'>路由器热点密码,删除可跳过连接<br>";
    html += "    </p>";
    html += "    <p>";
    html += "    &nbsp BlinKey:<input type='text' name='BlinKey' value='" + BlinKey + "'>点灯.blinker APP独立设备密钥<br>";
    html += "    </p>";
    html += "    <p>";
    html += "    舵机编号:<input type='text' class='txt'  readonly='readonly' value='X'>";
    html += "            <input type='text' class='txt'  readonly='readonly' value='Y'>";
    html += "            <input type='text' class='txt'  readonly='readonly' value='Z'>";
    html += "            <input type='text' class='txt'  readonly='readonly' value='E'>";
    if (ss >= 5)
      html += "            <input type='text' class='txt'  readonly='readonly' value='B'>";
    if (ss == 6)
      html += "            <input type='text' class='txt'  readonly='readonly' value='T'>";
    html += "    &nbsp各舵机&nbsp&nbsp编号名称</br>";
    html += "    初始角度:<input type='text' class='txt' name='Xraw' value='" + String((float)(rawdms[0] - 500) / factor, 1) + "'>";
    html += "            <input type='text' class='txt' name='Yraw' value='" + String((float)(rawdms[1] - 500) / factor, 1) + "'>";
    html += "            <input type='text' class='txt' name='Zraw' value='" + String((float)(rawdms[2] - 500) / factor, 1) + "'>";
    html += "            <input type='text' class='txt' name='Eraw' value='" + String((float)(rawdms[3] - 500) / factor, 1) + "'>";
    if (ss >= 5)
      html += "            <input type='text' class='txt' name='Braw' value='" + String((float)(rawdms[4] - 500) / factor, 1) + "'>";
    if (ss == 6)
      html += "            <input type='text' class='txt' name='Traw' value='" + String((float)(rawdms[5] - 500) / factor, 1) + "'>";
    html += "    舵机通电初始角度<br>";

    html += "    最小角度:<input type='text' class='txt' name='Xmin' value='" + String((float)(mindms[0] - 500) / factor, 1) + "'>";
    html += "            <input type='text' class='txt' name='Ymin' value='" + String((float)(mindms[1] - 500) / factor, 1) + "'>";
    html += "            <input type='text' class='txt' name='Zmin' value='" + String((float)(mindms[2] - 500) / factor, 1) + "'>";
    html += "            <input type='text' class='txt' name='Emin' value='" + String((float)(mindms[3] - 500) / factor, 1) + "'>";
    if (ss >= 5)
      html += "            <input type='text' class='txt' name='Bmin' value='" + String((float)(mindms[4] - 500) / factor, 1) + "'>";
    if (ss == 6)
      html += "            <input type='text' class='txt' name='Ymin' value='" + String((float)(mindms[5] - 500) / factor, 1) + "'>";
    html += "    舵机最小角度限制<br>";
    html += "    最大角度:<input type='text' class='txt' name='Xmax' value='" + String((float)(maxdms[0] - 500) / factor, 1) + "'>";
    html += "            <input type='text' class='txt' name='Ymax' value='" + String((float)(maxdms[1] - 500) / factor, 1) + "'>";
    html += "            <input type='text' class='txt' name='Zmax' value='" + String((float)(maxdms[2] - 500) / factor, 1) + "'>";
    html += "            <input type='text' class='txt' name='Emax' value='" + String((float)(maxdms[3] - 500) / factor, 1) + "'>";
    if (ss >= 5)
      html += "            <input type='text' class='txt' name='Bmax' value='" + String((float)(maxdms[4] - 500) / factor, 1) + "'>";
    if (ss == 6)
      html += "            <input type='text' class='txt' name='Tmax' value='" + String((float)(maxdms[5] - 500) / factor, 1) + "'>";
    html += "   舵机最大角度限制<br>";
    html += "    </p>";

    html += "    Auto次数:<input type='text' style='width:100px;height:20px;' name='Auto' value='0'>通电就执行 Auto.txt 多少次,-1 为无限次<br>";
    html += "    <p><a href='/index.html'  >[返回首页]</a>&nbsp&nbsp";
    html += "       <input type='submit' value='提交设置'>&nbsp提交后会重启控制板,要重连WIFI,重开控制网页";
    html += "    </p>";

    html += "   </form>";

    html += "</center>";
    html += "</body>";
    html += "</html>";
    Web.send(200, "text/html", html);
  }
}

//------------------------------------------------------------
//
//
//
//
//--------------------------------处理文件上传函数-------------------------------------------
void handleFileUpload()
{
  static File F; // 静态变量 文件对象用于文件上传

  HTTPUpload &UP = Web.upload(); // 上传对象
  if (UP.status == UPLOAD_FILE_START)
  {                                // 如果 状态=UPLOAD_FILE_START 开始上传
    String filename = UP.filename; // 上传的文件名
    if (!filename.startsWith("/"))
      filename = "/" + filename;    // 为文件名前加上"/"
    F = SPIFFS.open(filename, "w"); // 在SPIFFS中建立W重写文件用于写入用户上传的文件数据
  }
  if (UP.status == UPLOAD_FILE_WRITE)
  { // 如果上传状态为UPLOAD_FILE_WRITE
    if (F)
      F.write(UP.buf, UP.currentSize); // 向SPIFFS文件写入浏览器发来的文件数据 2048
  }
  if (UP.status == UPLOAD_FILE_END)
  {            // 如果上传状态为UPLOAD_FILE_END
    F.close(); // 关闭文件,完成上传
  }
  if (UP.status == UPLOAD_FILE_ABORTED)
  { // 中断或取消上传
    F.close();
  }
}

void FileUpload_OK()
{

