qiaoliang/arduino-learning/ESP8266/1-4-File_WIFI/src/main.cpp
  HTTPUpload &UP = Web.upload();
  String html = "<!DOCTYPE html>";
  html += "<html lang='zh-CN'>";
  html += "<head>";
  html += "  <meta  charset='UTF-8'>";
  html += "  <title>创客与编程</title>";
  html += "</head>";
  html += "<body>";
  html += "  <center>";
  html += "    <h1>上传文件成功.Size: " + String(UP.contentLength) + "</h1>"; // 文件成功保存
  html += "    <a href='/index.html'>[首页]</a>";
  html += "    <a href='/upload.html'>[继续上传]</a>";
  html += "  </center>";
  html += "</body>";
  html += "</html>";
  Web.send(200, "text/html", html);
}
//-------------------------------------------------------
//
//
//---------------处理用户浏览器的HTTP访问-------------------
void handleUserRequest()
{
  String url = Web.uri(); // 获取用户请求网址信息

  Serial.print(" 用户请求 ");
  Serial.println(url);

  if (url.endsWith("/"))
  {                      // 如果访问地址以"/"为结尾
    url = "/index.html"; // 将访问地址修改为/index.html文件
    if (!SPIFFS.exists(url))
    { // 还未上传首页文件跳转 文件上传 页
      Web.sendHeader("Location", "/upload.html");
      Web.send(303); // 303跳转
      return;
    }
  }

  if (url == "/upload.html")
  { // 请求上传文件 http://IP/upload.html
    String html = "<!DOCTYPE html>";
    html += "<html lang='zh-CN'>";
    html += "<head>";
    html += "  <meta  charset='UTF-8'>";
    html += "  <title>创客与编程</title>";
    html += "</head>";
    html += "<body>";
    html += "  <center>";
    html += "    <h1>ESP8266 SPIFFS 文件上传</h1>";
    html += "    <form method='POST' enctype='multipart/form-data'>";
    html += "      <input type='file' name='data' multiple>";
    html += "      <input class='button' type='submit' value='上传'>";
    html += "    </form>";
    html += "  </center>";
    html += "</body>";
    html += "</html>";
    Web.send(200, "text/html", html);
    return;
  }

  if (SPIFFS.exists(url))
  {                                     // 测试文件是否存在
    File file = SPIFFS.open(url, "r");  // "r"=只读打开文件
    Web.streamFile(file, getType(url)); // 发送文件给浏览器
    file.close();                       // 关闭文件
  }
  else
  {
    Web.send(404, "text/plain", "404 Not Found"); // 如果没有找到文件,则回复404 Not Found
  }
}
//---------------------------------------------------------------------------
String getType(String filename)
{ // 获取文件类型
  if (filename.endsWith(".htm"))
    return "text/html";
  else if (filename.endsWith(".html"))
    return "text/html";
  else if (filename.endsWith(".css"))
    return "text/css";
  else if (filename.endsWith(".js"))
    return "application/javascript";
  else if (filename.endsWith(".png"))
    return "image/png";
  else if (filename.endsWith(".gif"))
    return "image/gif";
  else if (filename.endsWith(".jpg"))
    return "image/jpeg";
  else if (filename.endsWith(".ico"))
    return "image/x-icon";
  else if (filename.endsWith(".xml"))
    return "text/xml";
  else if (filename.endsWith(".pdf"))
    return "application/x-pdf";
  else if (filename.endsWith(".zip"))
    return "application/x-zip";
  else if (filename.endsWith(".gz"))
    return "application/x-gzip";
  else if (filename.endsWith(".txt"))
    return "text/plain;charset=UTF-8";
  else if (filename.endsWith(".json"))
    return "text/plain;charset=UTF-8";
  return "text/plain";
}

